"""
用于检查是否有学校漏某个文件
"""

import os

school_dict = {
    '1': '广州市白云区中黄外国语小学', '2': '广州市白云区三元里小学（总校区）', '3': '广州市白云区三元里小学（北校区）',
    '4': '广州市白云区三元里小学（南校区）', '5': '羊城铁路总公司广州铁路第五小学', '6': '广州市白云区金桂园小学',
    '7': '广州市白云区广园小学（总校区）', '8': '广州市白云区广园小学（百事佳校区）', '9': '广州市白云区景泰小学（总校区）',
    '10': '广州市白云区景泰小学（柯子岭校区）', '11': '广州市白云区小太阳小学', '12': '广州市白云区松溪小学',
    '13': '广州市白云区螺涌小学', '14': '广州市白云区新苗小学', '15': '广州市白云区槎龙镇泰小学',
    '16': '广州市白云区龙德小学', '17': '广州市白云区江南明珠小学', '18': '广州市白云区桃园小学',
    '19': '广州市白云区明德小学（明德主校区）', '20': '广州市白云区明德小学（富康分校区）', '21': '广州市白云区同德小学',
    '22': '广州市白云区同心小学', '23': '广州市白云区岭南花园小学', '24': '广州市白云区江夏小学',
    '25': '广州市白云区陈田小学', '26': '广州市白云区马务小学', '27': '广州市白云区白云外国语小学',
    '28': '广州市白云区龙江小学', '29': '广州市白云区华丰小学', '30': '广州市白云区方圆实验小学',
    '31': '广州市白云区公度小学', '32': '广州市白云区远景小学（总校区）', '33': '广州市白云区远景小学（合益校区）',
    '34': '广州市白云区棠溪小学（总校区）', '35': '广州市白云区棠溪小学（百荣园校区）',
    '36': '广州市白云区贤丰第二实验小学', '37': '广州市白云区金源小学', '38': '广州市白云区机场西小学',
    '39': '广州市白云区龙溪小学', '40': '广州市白云区贤丰实验小学', '41': '广州市白云区萧岗小学',
    '42': '广州市白云区棠涌小学（总校区）', '43': '广州市白云区棠涌小学（紫荆校区）',
    '44': '广州市白云区汇侨第一小学（总校区）', '45': '广州市白云区汇侨第一小学（小坪校区）',
    '46': '广州市白云区汇侨第一小学（缤城校区）', '47': '广州市白云区春蕾小学', '48': '广州市白云区新园小学',
    '49': '广州市白云区同和小学', '50': '广州市白云区握山小学', '51': '广州市白云区金华小学',
    '52': '广州市白云区启明小学', '53': '广州市白云区广辉小学', '54': '广州市白云区京溪小学（京溪总校区）',
    '55': '广州市白云区京溪小学（恒大校区）', '56': '广州市白云区京溪小学（怡新校区）',
    '57': '广州市白云区京溪小学（白天鹅校区）', '58': '广州市白云区方正实验小学', '59': '广州市白云区华龙小学',
    '60': '广州市白云区诚美实验小学', '61': '广州市白云区新都小学', '62': '广州市白云区东平学校（初中总校区）',
    '63': '广州市白云区东平学校（小学部）', '64': '广州市白云区永泰小学', '65': '广州市白云区国泰小学',
    '66': '广州市白云区育贤小学', '67': '广州市白云区新兴白云小学', '68': '广州市白云区集贤小学',
    '69': '广州市白云区元下田小学', '70': '广州市白云区颐和实验小学', '71': '广州市白云区华师附中实验小学（北校区 总校）',
    '72': '广州市白云区华师附中实验小学（南校区）', '73': '广州市白云区华师附中实验小学（东校区）',
    '74': '广州市白云区鹤边镇泰小学', '75': '广州市白云区望岗小学', '76': '广州市白云区加禾小学',
    '77': '广州市白云区黄边小学（黄边总校区）', '78': '广州市白云区黄边小学（云山诗意校区）',
    '79': '广州市白云区黄边小学（乐得校区）', '80': '广州市白云区金龙小学', '81': '广州市白云区金晖小学',
    '82': '广州市白云区龙嘉小学', '83': '广州市白云区时代玫瑰园小学', '84': '广州市白云区平沙小学',
    '85': '广州市白云区石马小学', '86': '广州市白云区罗岗村小学', '87': '广州市白云区新科小学',
    '88': '广州市白云区长红小学', '89': '广州市白云区东方小学', '90': '广州市白云区清湖小学',
    '91': '广州市白云区平安小学', '92': '广州市白云区锦阳小学', '93': '广州市白云区石井张村中心小学',
    '94': '广州市白云区大岡小学', '95': '广州市白云区环滘小学', '96': '广州市白云区夏茅小学',
    '97': '广州市白云区大朗小学', '98': '广州市白云区唐阁小学', '99': '广州市白云区龙湖小学',
    '100': '广州市白云区滘心小学', '101': '广州市白云区鸦岗小学', '102': '广州市白云区朝阳小学',
    '103': '广州市白云区红星小学', '104': '广州市白云区潭岗小学（潭村主校区）', '105': '广州市白云区潭岗小学（凰岗分校区）',
    '106': '广州市白云区元培实验小学', '107': '广州市白云区新纪元小学', '108': '广州市白云区白云实验附属小学',
    '109': '广州市白云区金碧新城小学', '110': '广州市白云区横沙小学', '111': '广州市白云区沙凤小学（校本部）',
    '112': '广州市白云区沙凤小学（北校区）', '113': '广州市白云区新正小学', '114': '广州市白云区金沙小学（校本部）',
    '115': '广州市白云区金沙小学（南校区）', '116': '广州市白云区金沙小学（东校区）', '117': '广州市白云区人和镇第一小学',
    '118': '广州市白云区人和镇第二小学', '119': '广州市白云区人和镇第五小学（凤和总校区）',
    '120': '广州市白云区人和镇第五小学（太成校区）', '121': '广州市白云区人和镇第六小学',
    '122': '广州市白云区人和镇第七小学', '123': '广州市白云区广州空港实验小学（总校区）',
    '124': '广州市白云区广州空港实验小学（北校区）', '125': '广州市白云区广州空港实验小学（南校区）',
    '126': '广州市白云区东辉小学', '127': '广州市白云区才子小学', '128': '广州市白云区龙涛外国语实验小学',
    '129': '广州市白云区锦华小学', '130': '广州市白云区双岗小学', '131': '广州市白云区水沥小学',
    '132': '广州市白云区江村小学', '133': '广州市白云区茅山小学', '134': '广州市白云区蓼江小学',
    '135': '广州市白云区小塘小学', '136': '广州市白云区大田小学', '137': '广州市白云区江高镇中心小学',
    '138': '广州市白云区英才小学', '139': '广州市白云区长江小学', '140': '广州市白云区新楼小学',
    '141': '广州市白云区神山第一小学', '142': '广州市白云区神山第二小学', '143': '广州市白云区大岭小学',
    '144': '广州市白云区郭塘小学', '145': '广州市白云区神山第三小学', '146': '广州市白云区沙龙小学',
    '147': '广州市白云区石华小学', '148': '广州市白云区神山第五小学', '149': '羊城铁路总公司广州铁路第八小学',
    '150': '广州市白云区博海小学', '151': '广州市白云区文星小学', '152': '广州市白云区太和第一小学',
    '153': '广州市白云区大源小学', '154': '广州市白云区大沥小学', '155': '广州市白云区营溪小学',
    '156': '广州市白云区沙亭岗小学', '157': '广州市白云区头陂小学', '158': '广州市白云区穗丰学校',
    '159': '广州市白云区谢家庄小学', '160': '广州市白云区石湖小学', '161': '广州市白云区为民小学',
    '162': '广州市白云区金星小学', '163': '广州市白云区天宏小学', '164': '广州市白云区夏良小学',
    '165': '广州市白云区南村小学', '166': '广州市白云区永兴小学', '167': '广州市白云区南园小学',
    '168': '广州市白云区嘉龙小学', '169': '广州市白云区龙兴小学', '170': '广州市白云区蓝山小学',
    '171': '广州市白云区广东第二师范学院实验小学', '172': '广州市白云区蟠龙小学', '173': '广州市白云区东润小学',
    '174': '广州市白云区竹料第二小学', '175': '广州市白云区竹料第一小学', '176': '广州市白云区竹料第三小学',
    '177': '广州市白云区竹料第四小学', '178': '广州市白云区竹料第五小学', '179': '广州市白云区嘉美小学',
    '180': '广州市白云区良田第二小学', '181': '广州市白云区良田第三小学', '182': '广州市白云区良田第一小学',
    '183': '广州市白云区培英中学附属第二小学', '184': '广州市白云区茶山小学',
    '185': '广州市第六十五中学附属小学（富力校区）', '186': '广州市第六十五中学附属小学（侨德校区）',
    '187': '广州市培英中学附属小学', '188': '广州市白云区广大附中实验小学', '189': '广州市白云区金沙第二小学',
    '190': '广州市实验外语学校（小学部）', '191': '广州市白云区培英中学附属第三小学', '192': '广州市白云中学附属小学',
    '193': '广州市白云区颐和第二实验小学', '194': '广州市白云区庆丰实验学校',
    '195': '广州市白云区六中实验小学（北校区 总校）', '196': '广州市白云区六中实验小学（南校区）',
    '197': '广州市白云区白云广附同悦实验小学', '198': '广州市白云区白云广附金悦实验小学',
    '199': '广州市白云区云英实验附属小学', '200': '广州市白云区太和第二小学（总校区）',
    '201': '广州市白云区太和第二小学和龙校区', '202': '广州市白云区太和第二小学白山校区', '203': '广州市白云区龙岗学校',
    '204': '广州市三元里中学', '205': '广州市白云区梓元岗中学', '206': '广州市白云区景泰中学',
    '207': '广州市白云区白云外国语中学', '208': '广州市白云区龙江中学', '209': '广州市白云区龙涛外国语实验学校',
    '210': '广州市白云区新市中学', '211': '广州市白云区云英实验学校（初中部 总校）',
    '212': '广州市白云区云英实验学校（小学部）', '213': '广州市白云区华新学校', '214': '广州市白云区嘉禾中学',
    '215': '广州市白云区京师实验学校（初中部 总校）', '216': '广州市白云区京师实验学校（小学部）',
    '217': '广州市白云区平沙培英学校（初中部  总校）', '218': '广州市白云区平沙培英学校（小学部）',
    '219': '广州市第一一四中学', '220': '广州市白云区大朗中学', '221': '广州市白云区元培实验中学',
    '222': '广州市白云区云雅实验学校', '223': '广州市第七十三中学（初中部）', '224': '广州市第七十三中学（小学部）',
    '225': '广州市白云区六中实验中学（空港校区 总校）', '226': '广州市白云区六中实验中学（福和校区）',
    '227': '广州市白云区江村中学', '228': '广州市白云区江高镇第二初级中学', '229': '广州市白云区江高镇第三初级中学',
    '230': '广州市白云区神山   中学', '231': '广州市白云区石龙中学', '232': '广州市白云区珠江中学',
    '233': '广州市白云区太和中学', '234': '广州市第一一五中学', '235': '广州市第七十中学',
    '236': '广州市白云区龙归学校（总校区）', '237': '广州市白云区龙归学校小学部', '238': '广州市白云区新和学校',
    '239': '广州市白云区竹料第一中学', '240': '广州市白云区竹料第三中学', '241': '广州市白云区成龙中学',
    '242': '广州市第六十七中学', '243': '广州市广园中学', '244': '广州市白云区同和中学',
    '245': '广州市白云区颜乐天纪念中学', '246': '广州市白云区石井中学', '247': '广州市白云区金广实验学校（金域蓝湾校区）',
    '248': '广州市白云区金广实验学校（御金沙校区）', '249': '广州市白云区嘉禾新都学校（初中部 总校）',
    '250': '广州市白云区嘉禾新都学校（小学部）', '251': '广州华联外语实验学校（初中部 总校）',
    '252': '广州华联外语实验学校（小学部）', '253': '广州市白云区华赋学校总校区', '254': '广州市白云区华赋学校南校区',
    '255': '广州市白云区珠江实验学校', '256': '广州市白云区白云实验学校', '257': '广州市白云区民航学校（初中部）',
    '258': '广州市白云区民航学校（小学部）', '259': '广州市白云区黄石学校（黄石校区初中部）',
    '260': '广州市白云区黄石学校（黄石校区小学部）', '261': '广州市白云区黄石学校（祥景校区）',
    '262': '广州市白云区南悦中学', '263': '广州市白云区广大附中实验中学（北校区）',
    '264': '广州市白云区广大附中实验中学（南校区）', '265': '广州市白云区广州培文外国语学校', '266': '广州市源雅学校',
    '267': '广州市白云区应元颐和实验学校', '268': '广州市白云区广云外国语学校',
    '269': '广州市白云区白云广附云湖实验学校', '270': '广东实验中学（白云校区）', '271': '广东实验中学（云城校区）',
    '272': '广州市铁一中学（白云校区）', '273': '广东华侨中学（高中校区）', '274': '广东外语外贸大学实验中学北校区',
    '275': '广州市实验外语学校（中学部）', '276': '广州市庆丰实验学校', '277': '广州市培英中学（鹤洞校区）',
    '278': '广州市培英中学（岭南校区）', '279': '广州彭加木纪念中学', '280': '广州市第六十五中学（同德校区）',
    '281': '广州市第六十五中学（明德校区）', '282': '广州市第六十五中学（桃园校区）',
    '283': '广州市白云区广州空港实验中学（西校区）', '284': '广州市白云区广州空港实验中学（东校区）',
    '285': '广州大同中学（初中部）', '286': '广州市白云区广东第二师范学院实验中学（初中部）',
    '287': '广州市白云中学（汇侨校区）', '288': '广州市白云中学（棠景校区）', '289': '广州市启聪学校（广州实验教育集团花城实验学校）'
}

id_list = [item for item in school_dict.keys()]

file_path = r'C:\Users\1012986131\Desktop\工作文件\评聘部\义务教育优质均衡发展区\2025.06.04 - 提交教师资格查询截图或证件扫描件证明材料\收集内容'

# 获取目录下所有文件和子目录名
all_files = os.listdir(file_path)

dict1 = {}
for item in all_files:
    if item.split(".")[0] in dict1.keys():
        dict1[item.split(".")[0]] += 1

    else:
        dict1[item.split(".")[0]] = 1

"""
排查哪些学校只有一个文件
"""
# for keys, values in dict1.items():
#
#     if values != 2:
#         print(keys)

# print(dict1.keys())
"""
排查哪些学校缺了
"""
for item in id_list:
    if item not in dict1.keys():
        print(school_dict[item])
