"""
用来处理学生问卷统计的结果
"""
import copy
from collections import Counter

from func import *

data = read_xlsx_to_list(file_path=fr"2026.03.23 - 学生问卷/学生问卷.xlsx")

question = {
    "在本校上学，您的感觉是": {
        "A": "非常满意，学校各方面都有利于自己的发展",
        "B": "学校各方面还可以，基本令人满意",
        "C": "学校各方面都一般，不太满意",
        "D": "学校存在一些问题，不太利于自己的发展"
    },
    "您对贵校的校风、学风的基本评价是": {
        "A": "很好，很满意",
        "B": "还可以，能满足正常学习",
        "C": "不理想，对我们学习有一定影响",
        "D": "很差，严重影响了正常的教学秩序"
    },
    "您对贵校课堂教学效果的评价是": {
        "A": "满意，教学的效果好",
        "B": "还可以，大多都能掌握",
        "C": "不理想，只能是一知半解",
        "D": "很差，根本听不懂老师说啥"
    },
    "您觉得哪一种情况比较符合实际": {
        "A": "很少有老师在课堂上采用我喜欢的教学方法，大多数老师侧重自己讲，没什么方法。",
        "B": "一部分老师能在课堂上运用较为丰富和有效的教学方法，有时能激发我的学习兴趣。",
        "C": "大部分老师都能在课堂上运用多样且有效的教学方法，较好地激发我的学习兴趣。",
        "D": "几乎每位老师在课堂上采用的教学方法都能深深吸引我的兴趣，让我非常享受学习过程。"
    },
    "您最喜欢的教学方式是": {
        "A": "师生互动，能给予我们充分思考和展示空间的教学方式",
        "B": "老师讲解，学生听，不要让我们互动展示",
        "C": "活动化教学，学生活动为主，教师点拨",
        "D": "没所谓，随便老师怎么教都行"
    },
    "您对贵班老师的总体评价是": {
        "A": "都很关心学生，工作认真负责，责任心强，是我们的良师益友",
        "B": "多数老师都责任心强，教学认真负责，但教学水平有待提高",
        "C": "只能说有部分老师对学生好，也有责任心不强，对学生不怎么关心的",
        "D": "我们不是很满意，好多老师对我们都不怎么负责，很少关心我们"
    },
    "您敢于在课堂上表达自己独特的见解吗?这样的机会多吗?": {
        "A": "敢;很多",
        "B": "敢;很少",
        "C": "不敢;很多",
        "D": "不敢;很少"
    },
    "从星期一到星期五，你每天平均用多长时间完成老师布置的、包括学案(含巩固案)在内的课后作业?": {
        "A": "3小时以上",
        "B": "2~3小时",
        "C": "1~2小时",
        "D": "1小时以内"
    },
    "本学期老师批改作业(学案)或试卷的情况怎样?": {
        "A": "所有的老师都非常认真",
        "B": "大部分老师非常认真，少数老师不够认真",
        "C": "很多老师都不认真",
        "D": "老师经常不批改作业,做不做都没人过问"
    },
    "如果有某科成绩不理想，为了提高学业成绩，你最希望": {
        "A": "现在教我的老师对我专门辅导",
        "B": "找要好的同学或亲戚帮助",
        "C": "我自己再努力些便会提高",
        "D": "要求报读校外辅导班"
    },
    "对于物理、化学、生物等学科实验的情况是": {
        "A": "很少动手实验",
        "B": "经常动手实验",
        "C": "看老师堂上演示为主",
        "D": "通过观看实验视频为主"
    },
    "学校领导是否会在学生没有犯错的情况下找学生谈心，了解学生的情况与需求?": {
        "A": "我没有这经历，也没听同学听说过",
        "B": "我没有这经历，但听一两个同学说过",
        "C": "我没有这经历，但听一些个同学说过",
        "D": "我曾有这样的经历，学校领导耐心倾听"
    },
    "学校和班级组织阅读、文体、科技、校外活动的情况怎样?": {
        "A": "经常组织，我觉得十分丰富",
        "B": "定期组织，但我觉得还不够丰富",
        "C": "偶尔组织，没什么计划的",
        "D": "几乎不组织，没有这样的活动"
    }
}

for i in range(len(data)):
    for k in range(2, len(data[i])):
        if data[i][k] not in ["A", "B", "C", "D", ]:
            data[i][k] = "S"

# 用来保存每一题的结果数量和占比
temp_0 = {
    chara: {
        "人数": 0,
        "占比": "0.00%"
    } for chara in ["A", "B", "C", "D", "S"]
}

answer_dict = {
    f"第{i}题": copy.deepcopy(temp_0) for i in range(1, len(question.keys()) + 1)
}

data = data[1:]

data = [item[2:] for item in data]

data_1 = [list(row) for row in zip(*data)]

flag = 1
for item in data_1:
    temp = Counter(item)

    for key in temp.keys():
        answer_dict[f"第{flag}题"][key]["人数"] = temp[key]
        answer_dict[f"第{flag}题"][key]["占比"] = f"{round(temp[key] / len(item) * 100, 2)}%"
    flag += 1

print(answer_dict)

output = []
flag = 1
for key in question.keys():
    output.append([f"第{flag}题", key])
    output.append(["选项", "内容", "人数", "占比"])

    for i in ["A", "B", "C", "D", "S"]:
        output.append([i, question[key].get(i, "无填涂结果"), answer_dict[f"第{flag}题"][i]["人数"],
                       answer_dict[f"第{flag}题"][i]["占比"]])

    output.append([""])

    flag += 1

save_excel(output, "2026.03.23 - 学生问卷/学生问卷统计结果")
