from func import *

data = read_xlsx_to_list("1.xlsx")

school_code = {
    106: '广师大实中', 105: '江村中学', 107: '江高三中', 338: '培文学校', 89: '神山中学', 90: '石龙中学',
    295: '珠江中学', 350: '广州龙外', 121: '空港中学东校区', 125: '空港中学西校区', 344: '六中实验福和公办',
    340: '六中实验福和民办', 122: '六中实验空港校区', 124: '市73中', 323: '白云实验初中部', 165: '大朗中学',
    331: '广大附实北校区', 286: '广大附实南校区', 356: '广附云湖实验', 347: '广云外语初中部', 309: '华侨中学',
    172: '元培实验中学', 327: '南悦中学', 177: '彭中初中', 167: '庆丰实验学校初中部', 15: '石井中学', 164: '市114中',
    205: '市65中明德', 182: '市65中桃园', 310: '市65中同德', 377: '市65中江府', 288: '云雅实验学校', 359: '省实白云',
    306: '金广实验学校', 299: '广外实验', 312: '华赋太和', 135: '龙归中学', 69: '市115中', 136: '市70中',
    321: '穗丰中学', 68: '太和中学', 339: '源雅学校', 221: '白云外国语中学', 146: '白云中学汇侨校区',
    355: '白云中学棠景校区', 13: '广园中学', 231: '黄石学校', 196: '景泰中学', 232: '龙江中学', 188: '民航中学',
    186: '三元里中学', 145: '市67中', 144: '新市中学', 187: '梓元岗中学', 314: '东平学校', 76: '华联学校',
    272: '华新学校', 246: '嘉禾中学', 258: '京师实验', 334: '培英鹤洞', 315: '培英岭南', 353: '培英云城',
    297: '平沙培英初中', 166: '实验外语学校', 14: '同和中学', 266: '新都中学', 16: '颜乐天中学', 349: '颐和实验',
    265: '培英实验云景校区', 322: '珠江实验', 336: '铁一白云', 77: '启明中学', 289: '成龙中学', 51: '大同中学初中部',
    35: '二师实验初中', 36: '龙岗中学', 37: '新和中学', 46: '竹料三中', 45: '竹料一中北校区', 44: '竹料一中南校区',
    368: '培英实验同和校区', 369: '培英中学科技城校区', 370: '民航学校人和校区', 91: '竹料一中'
}

school_list = [int(item) for item in
               ['13', '14', '15', '16', '35', '36', '37', '44', '46', '51', '68', '69', '76', '89', '90', '105', '106',
                '107', '121',
                '122', '125', '135', '136', '144', '145', '146', '164', '165', '166', '167', '172', '177', '182', '186',
                '187', '188',
                '196', '205', '221', '231', '232', '246', '258', '265', '266', '272', '286', '288', '289', '295', '297',
                '299', '309',
                '310', '312', '314', '315', '321', '322', '323', '327', '331', '334', '336', '338', '339', '340', '344',
                '347', '349',
                '350', '353', '355', '356', '368', '369', '370', '377', '107']]

location_dict = {
    106: '江高镇', 105: '江高镇', 107: '江高镇', 338: '江高镇', 89: '江高镇', 90: '江高镇', 295: '江高镇',
    350: '人和镇', 121: '人和镇', 125: '人和镇', 344: '人和镇', 340: '人和镇', 122: '人和镇', 124: '人和镇',
    323: '石井片', 165: '石井片', 331: '石井片', 286: '石井片', 356: '石井片', 347: '石井片', 309: '石井片',
    172: '石井片', 327: '石井片', 177: '石井片', 167: '石井片', 15: '石井片', 164: '石井片', 205: '石井片',
    182: '石井片', 310: '石井片', 377: '江高镇', 288: '石井片', 359: '永平片', 306: '石井片', 299: '太和镇',
    312: '太和镇', 135: '太和镇', 69: '太和镇', 136: '太和镇', 321: '太和镇', 68: '太和镇', 339: '太和镇',
    221: '新市片', 146: '新市片', 355: '新市片', 13: '新市片', 231: '新市片', 196: '新市片', 232: '新市片',
    188: '新市片', 186: '新市片', 145: '新市片', 144: '新市片', 187: '新市片', 314: '永平片', 76: '永平片',
    272: '永平片', 246: '永平片', 258: '永平片', 334: '永平片', 315: '永平片', 353: '永平片', 297: '永平片',
    166: '永平片', 14: '永平片', 266: '永平片', 16: '永平片', 349: '永平片', 265: '永平片', 322: '永平片',
    336: '永平片', 77: '永平片', 289: '钟落潭镇', 51: '钟落潭镇', 35: '钟落潭镇', 36: '钟落潭镇', 37: '钟落潭镇',
    46: '钟落潭镇', 45: '钟落潭镇', 44: '钟落潭镇', 368: '永平片', 369: '石井片', 370: '人和镇', 91: '钟落潭镇'
}

output = {}

error_code = []

for item in data:
    try:
        area = location_dict[int(item[-1])]
        school = school_code[int(item[-1])]

        file_name = fr"{area} - {school}"

        if file_name not in output.keys():
            output[file_name] = [
                ["学籍号", "姓名", "年级", "班级", "考号", "现学校", "原学校", "考场", "座位号", "学校代码"]]

        output[file_name].append(item)

    except Exception as e:
        error_code.append(int(item[-1]))
        print(item[4])

for key in output.keys():
    save_excel(two_dimension_list=output[key], excel_name=fr"20260521/{key}")

for item in data:
    if int(item[-1]) not in school_list:
        print(item[-1])

for sch in school_list:
    if sch not in [int(item[-1]) for item in data]:
        print(school_code[int(sch)])
